Revit 2016 API
SlabFoundationType Enumeration
SlabFoundation type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This enum is obsolete in Revit 2016. Please use AnalyzeAs instead.")]
public enum SlabFoundationType
Visual Basic
<ObsoleteAttribute("This enum is obsolete in Revit 2016. Please use AnalyzeAs instead.")> _
Public Enumeration SlabFoundationType
Visual C++
[ObsoleteAttribute(L"This enum is obsolete in Revit 2016. Please use AnalyzeAs instead.")]
public enum class SlabFoundationType
Members
Member name | Description
SlabOneWay | SlabFoundationType is SlabOneWay.
SlabFoundation | SlabFoundationType is SlabFoundation.
SlabOnGrade | SlabFoundationType is SlabOnGrade.
SlabTwoWay | SlabFoundationType is SlabTwoWay.
See Also
Autodesk.Revit.DB.Structure Namespace